#include<iostream>
#include<math.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "rus");
    cout << "--------------------------------------------\nexample 1\n--------------------------------------------\n\n";
    cout << "Hello, World!";
    cout << "\n\n--------------------------------------------\nexample 2\n--------------------------------------------\n\n";
    cout << (2 + 3) * 5 << endl; // 25
    cout << 2 << " " << 3 << endl; // 2 3
    cout << "(2+3)*5=" << (2 + 3) * 5 << endl; // (2+3)*5=25
    cout << 1.0 / 3.0; // 0.3333333
    cout << "\n\n--------------------------------------------\nexample 3\n--------------------------------------------\n\n";
    int f; //описание переменной целого типа
    float l, o, x, s; //описание переменных вещественного типа
    cout << " c="; // вывод на экран комментария
    cin >> f; //ввод значения гипотенузы в целом формате
    cout << " x="; // вывод на экран комментария
    cin >> x; //ввод значения угла
    l = f * sin(x); // вычисление значений
    o = f * cos(x);
    s = l * o;
    cout << '\n' << " l=" << l << " o=" << o << '\n'; //вывод значений l,o
    cout << '\n' << " S =" << s;
    cout << "\n\n--------------------------------------------\nexample 4\n--------------------------------------------\n\n";
    string A = "jqmspo";
    for (int i = 0; i < A.size(); ++i) {
        A[i] = (A[i] - i) ^ 25;
    }
    cout << A << endl;

	cout << "\n-----------------------------------\nNumber 1\n-----------------------------------\n\n";

	cout << 1*2*3*4*5*6*7*8*9*10 << endl; //вывод факториала 10

	cout << "\n-----------------------------------\nNumber 2\n-----------------------------------\n\n";

	cout << "  _      _      _" << endl;	//построчно выводит изображение уточек
	cout << ">(.)__ <(.)__ =(.)__" << endl;
	cout << " (___/  (___/  (___/" << endl;

	cout << "\n-----------------------------------\nNumber 3\n-----------------------------------\n\n";

	cout << "1023456789876543201" << endl; //вывод наименьшего полиндрома со всеми цифрами, который делиться на 9

	cout << "\n-----------------------------------\nNumber 4\n-----------------------------------\n\n";

	cout << 1 + 1 << " + " << 1 + 1 << " = 4" << endl; //вывод суммы двоек без использования символа 2 в коде

	cout << "\n-----------------------------------\nNumber 4.1\n-----------------------------------\n\n";
    double a, b, c, d, y;
    cout << "Введите 4 числа:" << endl;
    cin >> a >> b >> c >> d;
    cout << "a = " << a << " b = " << b << " c = " << c << " d = " << d << endl;
    cout << "Введите числа x and y:" << endl;
    cin >> x >> y;
    cout << "x = " << x << " y = " << y << endl;
    double W, H, Q;
    W = (a + b) / (c + d);
    cout << "W = " << W << endl;
    H = (pow(a, 2)*x - 0.4*pow(sin(2*y), 3)) / (a*b*c) - (17.3 * pow(b, 2) * pow(abs(1 - pow(tan(x), 3)), 0.5));
    cout << "H = " << H << endl;
    Q = abs(pow(x, 0.5) + pow(x, 5) * pow(sin(y), 2)) / (pow(x, 2) * pow(y, 2));
    cout << "Q = " << Q << endl;
    cout << "\n-----------------------------------\nNumber 4.2\n-----------------------------------\n\n";
    double x1, x2, x3, y1, y2, y3, vx1, vx2, vx3, vy1, vy2, vy3, v1, v2, v3, deg, P, S;
    cout << "Введите координату первой вершины:" << endl;
    cin >> x1 >> y1;
    cout << "Введите координату второй вершины:" << endl;
    cin >> x2 >> y2;
    cout << "Введите координату третьей вершины:" << endl;
    cin >> x3 >> y3;
    vx1 = x1 - x2;
    vy1 = y1 - y2;
    vx2 = x2 - x3;
    vy2 = y2 - y3;
    vx3 = x3 - x1;
    vy3 = y3 - y1;
    v1 = abs(pow(pow(vx1, 2) + pow(vy1, 2), 0.5));
    v2 = abs(pow(pow(vx2, 2) + pow(vy2, 2), 0.5));
    v3 = abs(pow(pow(vx3, 2) + pow(vy3, 2), 0.5));
    P = v1 + v2 + v3;
    deg = acos(((vx1 * vx2) + (vy1 * vy2)) / (pow(pow(vx1, 2) + pow(vy1, 2), 0.5) * pow(pow(vx2, 2) + pow(vy2, 2), 0.5)));
    S = sin(deg) * v1 * v2 * 0.5;
    cout << "S треугольника = " << S << " P треугольника = " << P << endl;

}